#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/fer1035/aws01/runs/run-jwBfNYwuRFC6RnW8

Waiting for the plan to start...

Terraform v1.0.8
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.security_demo.aws_api_gateway_api_key.api_key: Refreshing state... [id=ihj63dfy4l]
module.security_demo.aws_api_gateway_rest_api.api: Refreshing state... [id=qnvmgu9rlh]
module.security_demo.aws_iam_role.iam_for_lambda: Refreshing state... [id=tf_lambda_role]
module.security_demo.aws_api_gateway_model.model: Refreshing state... [id=eio5d0]
module.security_demo.aws_api_gateway_request_validator.validator: Refreshing state... [id=xct5vd]
module.security_demo.aws_api_gateway_resource.resource: Refreshing state... [id=al7w62]
module.security_demo.aws_lambda_function.function: Refreshing state... [id=tf_lambda]
module.security_demo.aws_api_gateway_method.method: Refreshing state... [id=agm-qnvmgu9rlh-al7w62-POST]
module.security_demo.aws_api_gateway_method_response.response_200: Refreshing state... [id=agmr-qnvmgu9rlh-al7w62-POST-200]
module.security_demo.aws_wafv2_web_acl.waf_regional: Refreshing state... [id=155e333c-d687-4682-9d74-f62807218e7d]
module.security_demo.aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.security_demo.aws_api_gateway_integration.integration: Refreshing state... [id=agi-qnvmgu9rlh-al7w62-POST]
module.security_demo.aws_api_gateway_deployment.deployment: Refreshing state... [id=1lsitd]
module.security_demo.aws_api_gateway_stage.stage: Refreshing state... [id=ags-qnvmgu9rlh-test]
module.security_demo.aws_api_gateway_method_settings.all: Refreshing state... [id=qnvmgu9rlh-test-*/*]
module.security_demo.aws_api_gateway_usage_plan.usage_plan: Refreshing state... [id=35dwin]
module.security_demo.aws_api_gateway_usage_plan_key.plan_key: Refreshing state... [id=ihj63dfy4l]
module.security_demo.aws_wafv2_web_acl_association.waf_association: Refreshing state... [id=arn:aws:wafv2:us-east-1:531133914787:regional/webacl/StandardACL_Regional/155e333c-d687-4682-9d74-f62807218e7d,arn:aws:apigateway:us-east-1::/restapis/qnvmgu9rlh/stages/test]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.security_demo.aws_api_gateway_rest_api.api has been changed
  ~ resource "aws_api_gateway_rest_api" "api" {
        id                           = "qnvmgu9rlh"
        name                         = "myapi"
      + tags                         = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.security_demo.aws_api_gateway_api_key.api_key has been changed
  ~ resource "aws_api_gateway_api_key" "api_key" {
        id                = "ihj63dfy4l"
        name              = "my_api_key"
      + tags              = {}
        # (7 unchanged attributes hidden)
    }
  # module.security_demo.aws_api_gateway_method.method has been changed
  ~ resource "aws_api_gateway_method" "method" {
      + authorization_scopes = []
        id                   = "agm-qnvmgu9rlh-al7w62-POST"
        # (8 unchanged attributes hidden)
    }
  # module.security_demo.aws_api_gateway_integration.integration has been changed
  ~ resource "aws_api_gateway_integration" "integration" {
      + cache_key_parameters    = []
        id                      = "agi-qnvmgu9rlh-al7w62-POST"
      + request_parameters      = {}
      + request_templates       = {}
        # (10 unchanged attributes hidden)
    }
  # module.security_demo.aws_iam_role.iam_for_lambda has been changed
  ~ resource "aws_iam_role" "iam_for_lambda" {
        id                    = "tf_lambda_role"
        name                  = "tf_lambda_role"
      + tags                  = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.security_demo.aws_api_gateway_stage.stage has been changed
  ~ resource "aws_api_gateway_stage" "stage" {
        id                    = "ags-qnvmgu9rlh-test"
      + tags                  = {}
      + variables             = {}
        # (9 unchanged attributes hidden)
    }
  # module.security_demo.aws_api_gateway_usage_plan.usage_plan has been changed
  ~ resource "aws_api_gateway_usage_plan" "usage_plan" {
        id          = "35dwin"
        name        = "my_usage_plan"
      + tags        = {}
        # (3 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }
  # module.security_demo.aws_api_gateway_method_response.response_200 has been changed
  ~ resource "aws_api_gateway_method_response" "response_200" {
        id                  = "agmr-qnvmgu9rlh-al7w62-POST-200"
      + response_models     = {}
      + response_parameters = {}
        # (4 unchanged attributes hidden)
    }
  # module.security_demo.aws_lambda_function.function has been changed
  ~ resource "aws_lambda_function" "function" {
        id                             = "tf_lambda"
      ~ last_modified                  = "2021-10-14T04:02:11.294+0000" -> "2021-10-14T04:02:16.693+0000"
      + layers                         = []
      + tags                           = {}
        # (18 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }
  # module.security_demo.aws_wafv2_web_acl.waf_regional has been changed
  ~ resource "aws_wafv2_web_acl" "waf_regional" {
        id          = "155e333c-d687-4682-9d74-f62807218e7d"
        name        = "StandardACL_Regional"
      + tags        = {}
        # (6 unchanged attributes hidden)



        # (5 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.security_demo.aws_lambda_function.function will be updated in-place
  ~ resource "aws_lambda_function" "function" {
        id                             = "tf_lambda"
      ~ last_modified                  = "2021-10-14T04:02:16.693+0000" -> (known after apply)
      ~ source_code_hash               = "FAnl0SnsJjFNnSRRXmRoKLSPQ5zAPnNVhpi8vwbcwxI=" -> "/fLEOmzREVm78tXZGfpqOPfnAs6LiZh1k+D9Zy5O76I="
        tags                           = {}
        # (18 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.tennis.aws_cloudwatch_event_rule.rule will be created
  + resource "aws_cloudwatch_event_rule" "rule" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail      = {
                  + eventName         = [
                      + "PutObject",
                    ]
                  + eventSource       = [
                      + "s3.amazonaws.com",
                    ]
                  + requestParameters = {
                      + bucketName = [
                          + "pp-bucket1-us-east-1-531133914787",
                          + "pp-bucket2-us-east-1-531133914787",
                        ]
                    }
                }
              + detail-type = [
                  + "AWS API Call via CloudTrail",
                ]
              + source      = [
                  + "aws.s3",
                ]
            }
        )
      + id             = (known after apply)
      + is_enabled     = true
      + name           = "pp-rule-us-east-1-531133914787"
      + name_prefix    = (known after apply)
      + tags_all       = (known after apply)
    }

  # module.tennis.aws_cloudwatch_event_target.lambda will be created
  + resource "aws_cloudwatch_event_target" "lambda" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "pp-rule-us-east-1-531133914787"
      + target_id      = "pp-lambda-us-east-1-531133914787"

      + input_transformer {
          + input_paths    = {
              + "bucket" = "$.detail.requestParameters.bucketName"
              + "key"    = "$.detail.requestParameters.key"
            }
          + input_template = <<-EOT
                {
                  "bucket": <bucket>
                  "key": <key>
                }
            EOT
        }
    }

  # module.tennis.aws_iam_role.role will be created
  + resource "aws_iam_role" "role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = [
          + "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole",
        ]
      + max_session_duration  = 3600
      + name                  = "pp-role-us-east-1-531133914787"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = "pp-policy-us-east-1-531133914787"
          + policy = (known after apply)
        }
    }

  # module.tennis.aws_lambda_function.function will be created
  + resource "aws_lambda_function" "function" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "./modules/tennis/resources/lambda_function.zip"
      + function_name                  = "pp-lambda-us-east-1-531133914787"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "PBmIkDnEYyE0BilfULW8ohv5wNScwVNzN+TKlQqsCco="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "BUCJET1" = "pp-bucket1-us-east-1-531133914787"
              + "BUCJET2" = "pp-bucket2-us-east-1-531133914787"
              + "ENABLED" = "true"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.tennis.aws_lambda_permission.allow_cloudwatch will be created
  + resource "aws_lambda_permission" "allow_cloudwatch" {
      + action        = "lambda:InvokeFunction"
      + function_name = "pp-lambda-us-east-1-531133914787"
      + id            = (known after apply)
      + principal     = "events.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromEventBridge"
    }

  # module.tennis.aws_s3_bucket.bucket1 will be created
  + resource "aws_s3_bucket" "bucket1" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "pp-bucket1-us-east-1-531133914787"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.tennis.aws_s3_bucket.bucket2 will be created
  + resource "aws_s3_bucket" "bucket2" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "pp-bucket2-us-east-1-531133914787"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

Plan: 7 to add, 1 to change, 0 to destroy.


```

</details>

*Pusher: @fer1035, Action: `pull_request`*